docs/ccs-2023-interesting-paper.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-27 Sat 21:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interesting Researches of AI security in CCS 2023</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">Interesting Researches of AI security in CCS 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7be3c54">1. AIGC Related</a>
<ul>
<li><a href="#org8f0f01d">1.1. <span class="done DONE">DONE</span> Evading Watermark based Detection of AI-Generated Content</a></li>
<li><a href="#org6200c66">1.2. <span class="todo TODO">TODO</span> DE-FAKE: Detection and Attribution of Fake Images Generated by Text-to-Image Generation Models</a></li>
<li><a href="#org598aa59">1.3. <span class="todo TODO">TODO</span> Protecting Intellectual Property of Language Generation APIs with Lexical Watermark</a></li>
</ul>
</li>
<li><a href="#orgb7835ec">2. Relevant to my field and interesting</a>
<ul>
<li><a href="#orgd86056e">2.1. <span class="done DONE">DONE</span> Do Users Write More Insecure Code with AI Assistants?</a></li>
<li><a href="#org66f2ab8">2.2. <span class="todo TODO">TODO</span> Unsafe Diffusion: On the Generation of Unsafe Images and Hateful Memes From Text-To-Image Models</a></li>
<li><a href="#org95953a8">2.3. <span class="todo REVIEW">REVIEW</span> Stealing the Decoding Algorithms of Language Models</a></li>
</ul>
</li>
<li><a href="#org11c0045">3. Not relevant but interesting and maybe valuable</a>
<ul>
<li><a href="#orgaf19ca8">3.1. <span class="todo TODO">TODO</span> P-Forward: Fine-tuning and Inference on Language Models with Differential Privacy in Forward Pass</a></li>
<li><a href="#orgb055a10">3.2. <span class="todo TODO">TODO</span> Stolen Risks of Models with Security Properties</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7be3c54" class="outline-2">
<h2 id="org7be3c54"><span class="section-number-2">1.</span> AIGC Related</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8f0f01d" class="outline-3">
<h3 id="org8f0f01d"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> Evading Watermark based Detection of AI-Generated Content</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3576915.3623189">https://dl.acm.org/doi/10.1145/3576915.3623189</a></li>
<li>a method to bypass (evading) the watermark-based AIGC detection.</li>
</ul>
</div>
</div>
<div id="outline-container-org6200c66" class="outline-3">
<h3 id="org6200c66"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> DE-FAKE: Detection and Attribution of Fake Images Generated by Text-to-Image Generation Models</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://arxiv.org/abs/2210.06998">https://arxiv.org/abs/2210.06998</a></li>
</ul>
</div>
</div>
<div id="outline-container-org598aa59" class="outline-3">
<h3 id="org598aa59"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> Protecting Intellectual Property of Language Generation APIs with Lexical Watermark</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://arxiv.org/abs/2112.02701">https://arxiv.org/abs/2112.02701</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb7835ec" class="outline-2">
<h2 id="orgb7835ec"><span class="section-number-2">2.</span> Relevant to my field and interesting</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd86056e" class="outline-3">
<h3 id="orgd86056e"><span class="section-number-3">2.1.</span> <span class="done DONE">DONE</span> Do Users Write More Insecure Code with AI Assistants?</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/abs/10.1145/3576915.3623157">https://dl.acm.org/doi/abs/10.1145/3576915.3623157</a></li>
<li>Overall, we find that participants who had access to an AI assistant wrote significantly less secure code than those without access to an assistant. Participants with access to an AI assistant were also more likely to believe they wrote secure code, suggesting that such tools may lead users to be overconfident about security flaws in their code.</li>
</ul>
</div>
</div>
<div id="outline-container-org66f2ab8" class="outline-3">
<h3 id="org66f2ab8"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> Unsafe Diffusion: On the Generation of Unsafe Images and Hateful Memes From Text-To-Image Models</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3576915.3616679">https://dl.acm.org/doi/10.1145/3576915.3616679</a></li>
</ul>
</div>
</div>
<div id="outline-container-org95953a8" class="outline-3">
<h3 id="org95953a8"><span class="section-number-3">2.3.</span> <span class="todo REVIEW">REVIEW</span> Stealing the Decoding Algorithms of Language Models</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3576915.3616652">https://dl.acm.org/doi/10.1145/3576915.3616652</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org11c0045" class="outline-2">
<h2 id="org11c0045"><span class="section-number-2">3.</span> Not relevant but interesting and maybe valuable</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaf19ca8" class="outline-3">
<h3 id="orgaf19ca8"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> P-Forward: Fine-tuning and Inference on Language Models with Differential Privacy in Forward Pass</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3576915.3616592">https://dl.acm.org/doi/10.1145/3576915.3616592</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb055a10" class="outline-3">
<h3 id="orgb055a10"><span class="section-number-3">3.2.</span> <span class="todo TODO">TODO</span> Stolen Risks of Models with Security Properties</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3576915.3616653">https://dl.acm.org/doi/10.1145/3576915.3616653</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Sat Dec 30 21:06:13 2023</span> <span class="date">Last modified: 2025-09-27 Sat 19:50</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
